#Дано целое число N (>0), являющееся некоторой степенью числа 2: N = 2K. Найти целое число K - показатель степени.

n = input("Введите целое число: ")

while True:
    try:
        n = int(n)
        if n <= 0:
            print("Число должно быть больше нуля!")
            n = input("Введите целое число: ")
        else:
            if (n & (n - 1)) == 0:
                continue
                k = 0
                while n > 1:
                    n //= 2
                    k += 1
                print(f"Число {n} = 2^{k}")
                print(f"Показатель степени k = {k}")
                break
            else:
                print(f"Ошибка: число {n} не является степееью двойки!")

    except ValueError:
        print("Ошибка: введите целое число!")