#Дано целое число N (>0), являющееся некоторой степенью числа 2: N = 2K. Найти целое число K - показатель степени.
try:
    n = int(input("Введите целое число: "))

    if n <= 0:
        print("Число должно быть больше нуля!")
        n = int(input("Введите целое число: "))

    num = n
    k = 0
    while num > 1:
        if num % 2 == 0:
            num = num // 2
            k += 1
        else:
            break

    if num == 1:
        print(f"Число {n} = 2^{k}")
        print(f"Показатель степени k = {k}")
    else:
        print(f"Ошибка: число {n} не является степенью двойки!")
except ValueError:
    print("Ошибка: введите целое число!")